stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
use super::{marker, Alternate, NoPin, OpenDrain, Pin, PinMode, PushPull};
use crate::{gpio, i2c, i2s, pac, serial, spi};

pub(crate) struct Const<const A: u8>;

pub(crate) trait SetAlternate<const A: u8, Otype> {
    fn set_alt_mode(&mut self);
    fn restore_mode(&mut self);
}
impl<Otype> SetAlternate<0, Otype> for NoPin {
    fn set_alt_mode(&mut self) {}
    fn restore_mode(&mut self) {}
}
impl<const P: char, const N: u8, MODE: PinMode + marker::NotAlt, const A: u8>
    SetAlternate<A, PushPull> for Pin<P, N, MODE>
{
    fn set_alt_mode(&mut self) {
        self.mode::<Alternate<A, PushPull>>();
    }

    fn restore_mode(&mut self) {
        self.mode::<MODE>();
    }
}

impl<const P: char, const N: u8, MODE: PinMode + marker::NotAlt, const A: u8>
    SetAlternate<A, OpenDrain> for Pin<P, N, MODE>
{
    fn set_alt_mode(&mut self) {
        self.mode::<Alternate<A, OpenDrain>>();
    }

    fn restore_mode(&mut self) {
        self.mode::<MODE>();
    }
}

impl<const P: char, const N: u8, const A: u8> SetAlternate<A, PushPull>
    for Pin<P, N, Alternate<A, PushPull>>
{
    fn set_alt_mode(&mut self) {}
    fn restore_mode(&mut self) {}
}

impl<const P: char, const N: u8, const A: u8> SetAlternate<A, OpenDrain>
    for Pin<P, N, Alternate<A, OpenDrain>>
{
    fn set_alt_mode(&mut self) {}
    fn restore_mode(&mut self) {}
}

pub(crate) trait PinA<PIN, PER> {
    type A;
}

impl<PIN, PER> PinA<PIN, PER> for NoPin
where
    PIN: crate::Sealed,
    PER: crate::Sealed,
{
    type A = Const<0>;
}

macro_rules! pin {
    ( $($name:ident, <$Pin:ty, $I2C:ident> for $(no: $NoPin:ty,)? [$(
            $(#[$attr:meta])* $PX:ident<$A:literal $(, $Otype:ident)?>,
        )*],)*) => {
            $(
                $(
                    $(#[$attr])*

                        impl<MODE> PinA<$Pin, pac::$I2C> for gpio::$PX<MODE> {
                            type A = Const<$A>;
                        }
                )*

                #[derive(Debug)]
                pub enum $name {
                    $(
                        None($NoPin),
                    )?

                    $(
                        $(#[$attr])*
                        $PX(gpio::$PX<Alternate<$A $(, $Otype)?>>),
                    )*
                }

                $(
                    impl From<$NoPin> for $name {
                        fn from(p: $NoPin) -> Self {
                            Self::None(p)
                        }
                    }

                    #[allow(irrefutable_let_patterns)]
                    impl TryFrom<$name> for $NoPin {
                        type Error = ();

                        fn try_from(a: $name) -> Result<Self, Self::Error> {
                            if let $name::None(p) = a {
                                Ok(p)
                            } else {
                                Err(())
                            }
                        }
                    }
                )?

                $(
                    $(#[$attr])*
                    impl From<gpio::$PX> for $name {
                        fn from(p: gpio::$PX) -> Self {
                            Self::$PX(p.into_mode())
                        }
                    }

                    $(#[$attr])*
                    impl From<gpio::$PX<Alternate<$A $(, $Otype)?>>> for $name {
                        fn from(p: gpio::$PX<Alternate<$A $(, $Otype)?>>) -> Self {
                            Self::$PX(p.into_mode())
                        }
                    }

                    $(#[$attr])*
                    #[allow(irrefutable_let_patterns)]
                    impl<MODE: PinMode> TryFrom<$name> for gpio::$PX<MODE> {
                        type Error = ();

                        fn try_from(a: $name) -> Result<Self, Self::Error> {
                            if let $name::$PX(p) = a {
                                Ok(p.into_mode())
                            } else {
                                Err(())
                            }
                        }
                    }
                )*
            )*
    };
}

// CAN pins

#[cfg(all(feature = "can", feature = "can1"))]
pub mod can1 {
    use super::*;
    use crate::can;

    pin! {
        Tx, <can::Tx, CAN1> for no:NoPin, [
            PA12<9>,
            PD1<9>,

            #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
            PB9<8>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PB9<9>,

            #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
            PG1<9>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PH13<9>,
        ],

        Rx, <can::Rx, CAN1> for no:NoPin, [
            PA11<9>,
            PD0<9>,

            #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
            PB8<8>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PB8<9>,

