stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
            #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
            PG0<9>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PI9<9>,
        ],
    }
}

#[cfg(all(feature = "can", feature = "can2"))]
pub mod can2 {
    use super::*;
    use crate::can;

    pin! {
        Tx, <can::Tx, CAN2> for no:NoPin, [
            PB13<9>,
            PB6<9>,

            #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
            PG12<9>,
        ],

        Rx, <can::Rx, CAN2> for no:NoPin, [
            PB12<9>,
            PB5<9>,

            #[cfg(any(feature = "stm32f412", feature = "stm32f413", feature = "stm32f423"))]
            PG11<9>,
        ],
    }
}

#[cfg(all(feature = "can", feature = "can3"))]
pub mod can3 {
    use super::*;
    use crate::can;

    pin! {
        Tx, <can::Tx, CAN3> for no:NoPin, [PA15<11>, PB4<11>,],
        Rx, <can::Rx, CAN3> for no:NoPin, [PA8<11>, PB3<11>,],
    }
}

// I2C pins

pub mod i2c1 {
    use super::*;

    pin! {
        Scl, <i2c::Scl, I2C1> for [PB6<4, OpenDrain>, PB8<4, OpenDrain>,],

        Sda, <i2c::Sda, I2C1> for [PB7<4, OpenDrain>, PB9<4, OpenDrain>,],
    }
}

pub mod i2c2 {
    use super::*;

    pin! {
        Sda, <i2c::Sda, I2C2> for [
            #[cfg(any(feature = "stm32f446"))]
            PB3<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f410",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PB3<9, OpenDrain>,

            #[cfg(any(
                feature = "stm32f410",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PB9<9, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f410",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PB11<4, OpenDrain>,

            #[cfg(any(feature = "stm32f446"))]
            PC12<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PF0<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PH5<4, OpenDrain>,
        ],

        Scl, <i2c::Scl, I2C2> for [
            PB10<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PF1<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PH4<4, OpenDrain>,
        ],
    }
}

#[cfg(feature = "i2c3")]
pub mod i2c3 {
    use super::*;

    pin! {
        Scl, <i2c::Scl, I2C3> for [
            PA8<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PH7<4, OpenDrain>,
        ],

        Sda, <i2c::Sda, I2C3> for [
            PC9<4, OpenDrain>,

            #[cfg(feature = "stm32f446")]
            PB4<4, OpenDrain>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PB4<9, OpenDrain>,

            #[cfg(any(
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PB8<9, OpenDrain>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PH8<4, OpenDrain>,
        ],
    }
}

#[cfg(feature = "fmpi2c1")]
pub mod fmpi2c1 {
    use super::*;
    pin! {
        Sda, <i2c::Sda, FMPI2C1> for [
            PB3<4, OpenDrain>,
            PB14<4, OpenDrain>,
            PC7<4, OpenDrain>,
            PD13<4, OpenDrain>,
            PD15<4, OpenDrain>,
            PF15<4, OpenDrain>,
        ],
        Scl, <i2c::Scl, FMPI2C1> for [
            PB10<9, OpenDrain>,
            PB15<4, OpenDrain>,
            PC6<4, OpenDrain>,
            PD12<4, OpenDrain>,
            PD14<4, OpenDrain>,
            PF14<4, OpenDrain>,
        ],
    }
}

// SPI pins

pub mod spi1 {
    use super::*;
    pin! {
        Sck, <spi::Sck,  SPI1> for no:NoPin, [PA5<5>, PB3<5>,],

        Miso, <spi::Miso, SPI1> for no:NoPin, [PA6<5>, PB4<5>,],

        Mosi, <spi::Mosi, SPI1> for no:NoPin, [
            PA7<5>, PB5<5>,
        ],

