stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
        Nss, <spi::Nss,  SPI1> for [
            #[cfg(any(
                feature = "stm32f410",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f446"
            ))]
            PA4<5>,
            #[cfg(any(
                feature = "stm32f410",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f446"
            ))]
            PA15<5>,
        ],
    }
}

pub mod spi2 {
    use super::*;
    pin! {
        Sck, <spi::Sck,  SPI2> for no:NoPin, [
            PB10<5>,
            PB13<5>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PD3<5>,

            #[cfg(any(
                feature = "stm32f410",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f446"
            ))]
            PC7<5>,

            #[cfg(any(
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f469",
                feature = "stm32f479",
                feature = "stm32f446"
            ))]
            PA9<5>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PI1<5>,
        ],

        Miso, <spi::Miso, SPI2> for no:NoPin, [
            PB14<5>, PC2<5>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PI2<5>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PA12<5>,
        ],

        Mosi, <spi::Mosi, SPI2> for no:NoPin, [
            PB15<5>,
            PC3<5>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PI3<5>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PA10<5>,

            #[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
            PC1<5>,

            #[cfg(feature = "stm32f446")]
            PC1<7>,
        ],

        Nss, <spi::Nss,  SPI2> for [
            PB9<5>,
            PB12<5>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PI0<5>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PA11<5>,

            #[cfg(feature = "stm32f446")]
            PB4<7>,

            #[cfg(feature = "stm32f446")]
            PD1<7>,
        ],
    }
}

#[cfg(feature = "spi3")]
pub mod spi3 {
    use super::*;
    pin! {
        Sck, <spi::Sck,  SPI3> for no:NoPin, [
            PB3<6>,
            PC10<6>,

            #[cfg(any(
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PB12<7>,
        ],

        Miso, <spi::Miso, SPI3> for no:NoPin, [PB4<6>, PC11<6>,],

        Mosi, <spi::Mosi, SPI3> for no:NoPin, [
            PB5<6>,
            PC12<6>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PD6<5>,

            #[cfg(feature = "stm32f446")]
            PB0<7>,
            #[cfg(feature = "stm32f446")]
            PB2<7>,
            #[cfg(feature = "stm32f446")]
            PC1<5>,
            #[cfg(feature = "stm32f446")]
            PD0<6>,
        ],

        Nss, <spi::Nss, SPI3> for [PA4<6>, PA15<6>,],
    }
}

#[cfg(feature = "spi4")]
pub mod spi4 {
    use super::*;

    pin! {
        Sck, <spi::Sck,  SPI4> for no:NoPin, [
            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PE2<5>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PE12<5>,

            #[cfg(any(
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PB13<6>,

            #[cfg(feature = "stm32f446")]
            PG11<6>,
        ],

        Miso, <spi::Miso, SPI4> for no:NoPin, [
            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PE5<5>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PE13<5>,

            #[cfg(any(
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PA11<6>,

            #[cfg(feature = "stm32f446")]
            PG12<6>,

            #[cfg(feature = "stm32f446")]
            PD0<5>,
        ],

        Mosi, <spi::Mosi, SPI4> for no:NoPin, [
            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PE6<5>,

            #[cfg(any(
                feature = "stm32f401",
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PE14<5>,

            #[cfg(any(
                feature = "stm32f411",
                feature = "stm32f412",
                feature = "stm32f413",
                feature = "stm32f423"
            ))]
            PA1<5>,

            #[cfg(feature = "stm32f446")]
            PG13<6>,
        ],

