stm32-rs/stm32f4xx-hal/src/gpio/alt.rs
        Rx, <serial::RxPin, UART4> for no:NoPin, [
            PA1<8>,

            #[cfg(any(
                feature = "stm32f405",
                feature = "stm32f407",
                feature = "stm32f415",
                feature = "stm32f417",
                feature = "stm32f427",
                feature = "stm32f429",
                feature = "stm32f437",
                feature = "stm32f439",
                feature = "stm32f446",
                feature = "stm32f469",
                feature = "stm32f479"
            ))]
            PC11<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PA11<11>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PD0<11>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PC11<8>,
        ],
    }
}

#[cfg(feature = "uart5")]
pub mod uart5 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, UART5> for no:NoPin, [
            PC12<8>,

            #[cfg(feature = "stm32f446")]
            PE8<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB6<11>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB9<11>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB13<11>,
        ],

        Rx, <serial::RxPin, UART5> for no:NoPin, [
            PD2<8>,

            #[cfg(feature = "stm32f446")]
            PE7<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB5<11>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB8<11>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB12<11>,
        ],
    }
}

#[cfg(feature = "uart7")]
pub mod uart7 {
    use super::*;

    pin! {
        Tx,<serial::TxPin, UART7> for no:NoPin, [
            #[cfg(feature = "gpioe")]
            PE8<8>,

            #[cfg(feature = "gpiof")]
            PF7<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PA15<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB4<8>,
        ],

        Rx, <serial::RxPin, UART7> for no:NoPin, [
            #[cfg(feature = "gpioe")]
            PE7<8>,

            #[cfg(feature = "gpiof")]
            PF6<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PA8<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PB3<8>,
        ],
    }
}

#[cfg(feature = "uart8")]
pub mod uart8 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, UART8> for no:NoPin, [
            #[cfg(feature = "gpioe")]
            PE1<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PF9<8>,
        ],

        Rx, <serial::RxPin, UART8> for no:NoPin, [
            #[cfg(feature = "gpioe")]
            PE0<8>,

            #[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
            PF8<8>,
        ],
    }
}

#[cfg(feature = "uart9")]
pub mod uart9 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, UART9> for no:NoPin, [PD15<11>, PG1<11>,],
        Rx, <serial::RxPin, UART9> for no:NoPin, [PD14<11>, PG0<11>,],
    }
}

#[cfg(feature = "uart10")]
pub mod uart10 {
    use super::*;

    pin! {
        Tx, <serial::TxPin, UART10> for no:NoPin, [PE3<11>, PG12<11>,],
        Rx, <serial::RxPin, UART10> for no:NoPin, [PE2<11>, PG11<11>,],
    }
}
